import * as _ from 'lodash';

const GREEK = {
  '!':'!',    '"':'᾿',    '#':'῎',    '$':'῎',    '%':'῞',    '&':'&',    '\'':'\'', '(':'(',
  ')':')',    '*':'*',    '+':'΅',    ',':',',    '-':'-',    '.':'.',    '/':'´', '0':'0',
  '1':'1',    '2':'2',    '3':'3',    '4':'4',    '5':'5',    '6':'6',    '7':'7', '8':'8',
  '9':'9',    ':':':',    ';':'῾',    '<':'<',    '=':'=',    '>':'>',    '?':'?', '@':'@',
  'A':'Α',    'B':'Β',    'C':'Χ',    'D':'Δ',    'E':'Ε',    'F':'Φ',    'G':'Γ', 'H':'Η',
  'I':'Ι',    'J':'῍',    'K':'Κ',    'L':'Λ',    'M':'Μ',    'N':'Ν',    'O':'Ο', 'P':'Π',
  'Q':'Ψ',    'R':'Ρ',    'S':'Σ',    'T':'Τ',    'U':'Υ',    'V':'•',    'W':'Ω', 'X':'Ξ',
  'Y':'Θ',    'Z':'Ζ',    '[':'[',    '\\':'`',   ']':']',    '^':'῞',    '_':'῀', '`':'ι',
  'a':'α',    'b':'β',    'c':'χ',    'd':'δ',    'e':'ε',    'f':'φ',    'g':'γ', 'h':'η',
  'i':'ι',    'j':'῝',    'k':'κ',    'l':'λ',    'm':'μ',    'n':'ν',    'o':'ο', 'p':'π',
  'q':'ψ',    'r':'ρ',    's':'σ',    't':'τ',    'u':'υ',    'v':'ς',    'w':'ω', 'x':'ξ',
  'y':'θ',    'z':'ζ',    '{':'῟',    '|':'|',    '}':'῏',    '~':'~',
};

const HEBREW = {
  '!':'!',      '"':'\u05b2', '#':'\u05B2',  '$':'\u05B3', '%':'\u05B1', '&':'&',     '\'':'\u05B7', '(':'(',
  ')':')',      '*':'*',      '+':'\u05BC',  ',':',',      '-':'-',      '.':'.',      '/':'\u05B8', '0':'0',
  '1':'1',      '2':'2',      '3':'3',       '4':'4',      '5':'5',      '6':'6',      '7':'7',      '8':'8',
  '9':'9',      ':':'\u05C3', ';':'\u05B0',  '<':'<',      '=':'\u05BC', '>':'>',      '?':'?',      '@':'@',
  'A':'-',      'B':'-',      'C':'\u05BB',  'D':'‬-',      'E':'-',      'F':'‬\u05BA', 'G':'-',      'H':'-',
  'I':'‬\u05B4', 'J':'-',      'K':'ך‬',       'L':'-',      'M':'ם‬',      'N':'ן',       'O':'-',      'P':'ף‬',
  'Q':'-',      'R':'-',      'S':'\u05C2',  'T':'‬ך',      'U':'‬ץ‬',      'V':'\u05C1',  'W':'-',      'X':'ה',
  'Y':'ץ',      'Z':'-',      '[':'\u05B5', '\\':'\u05B8', ']':'\u05B6', '^':'-',      '_':'\u05B0',  '`':'`',
  'a':'א',      'b':'ב',      'c':'\u05BB',  'd':'ד',      'e':'ע',      'f':'\u05C2', 'g':'ג',       'h':'ה‬',
  'i':'‬\u05B4', 'j':'ט',      'k':'כ',       'l':'ל',      'm':'מ',      'n':'נ',      'o':'ס',       'p':'פ‬',
  'q':'ק',      'r':'ר',      's':'ש',       't':'ת',      'u':'צ',      'v':'ש',      'w':'ו',       'x':'ח',
  'y':'י',       'z':'ז',      '{':'\u05B7', '|':'|',       '}':'\u05B6', '~':'~',
};

// const HEBREW2 = {
//   '!':'!',    '"':'"',    '#':'#',    '$':'$',    '%':'%',    '&':'&',    '\'':'א',  '(':'(',
//   ')':')',    '*':'*',    '+':'+',    ',':',',    '-':'-',    '.':'.',    '/':'/',   '0':'0',
//   '1':'1',    '2':'2',    '3':'3',    '4':'4',    '5':'5',    '6':'6',    '7':'7',   '8':'8',
//   '9':'9',    ':':':',    ';':';',    '<':'<',    '=':'=',    '>':'>',    '?':'?',   '@':'@',
//   'A':'A',    'B':'B',    'C':'C',    'D':'D',    'E':'E',    'F':'F',    'G':'G',   'H':'ש',
//   'I':'I',    'J':'ם',    'K':'K',    'L':'L',    'M':'M',    'N':'N',    'O':'O',   'P':'P',
//   'Q':'Q',    'R':'R',    'S':'S',    'T':'T',    'U':'U',    'V':'V',    'W':'W',   'X':'X',
//   'Y':'Y',    'Z':'Z',    '[':'[',    '\\':'\\',  ']':']',    '^':'^',    '_':'_',   '`':'`',
//   'a':'a',    'b':'ב',    'c':'c',    'd':'d',    'e':'e',    'f':'f',    'g':'g',   'h':'ה',
//   'i':'i',    'j':'j',    'k':'k',    'l':'l',    'm':'m',    'n':'n',    'o':'o',   'p':'p',
//   'q':'q',    'r':'ר',    's':'s',    't':'ת',    'u':'u',    'v':'v',    'w':'ו',   'x':'x',
//   'y':'y',    'z':'z',    '{':'{',    '|':'|',    '}':'}',    '~':'~',
// };
//  ב ְ ּ ר ֵ א ש ִ ׁ ֖ י ת 
// b Р ь r г ' H i y t
// "<p><sup>1</sup> בְּרֵאשִׁ֖יתH7225 <font color='#7a8080'>be-re-Shit</font> In the beginning בָּרָ֣אH1254 <font color='#7a8080'>ba-Ra</font> created אֱלֹהִ֑יםH430 <font color='#7a8080'>E-lo-Him;</font> God אֵ֥תH853 <font color='#7a8080'>'et הַשָּׁמַ֖יִםH8064 <font color='#7a8080'>hash-sha-Ma-yim</font> the heaven וְאֵ֥תH853 <font color='#7a8080'>ve-'Et הָאָֽרֶץ׃H776 <font color='#7a8080'>ha-'A-retz.</font> the earth</font></sup>"
//"<sup>1</sup> :¦еrA'Ah tE'Мw ЈЗyamAKHah tE' ЈyihИlй' 'ЯrAРb tyiH'гrьРb<br>"
export function convertFontToUtf8(fontName, text) {
  if(!fontName) return text;
  let table = null;
  if (fontName.match(/^(grk|graeca|symbol)/i)) table = GREEK;
  if (fontName.match(/^heb/i)) table = HEBREW;
  // if (fontName.match(/^sil ezra/i)) table = HEBREW2;
  if (!table) return text;
  let res = text.split('').map(c => (table[c] || c));
  if (table === HEBREW) res = _.reverse(res);
  return res.join('');
}

export function convertToUtf8(text, fontName) {
  return convertFontToUtf8(fontName, text);
}